app/Controllers/AppController.php

SELECT *
FROM `foto`
ORDER BY `judul_foto` ASC
---
    public function home(){
        $judul_foto = $this->request->getVar("judul_foto");
        if($judul_foto == null){
            $rows = $this->fotoModel
                ->orderBy("judul_foto","asc")
                ->FindAll();

SELECT *
FROM `album`
ORDER BY `album_id` ASC
SELECT *
FROM `user`
ORDER BY `user_id` ASC
---
    public function tambah_foto(){
        $rows1 = $this->albumModel
                ->orderBy("album_id","asc")
                ->FindAll();
        $rows2 = $this->userModel
                ->orderBy("user_id","asc")
                ->FindAll();

SELECT *
FROM `foto`
LEFT JOIN `album` ON `album`.`album_id`=`foto`.`album_id`
LEFT JOIN `user` ON `user`.`user_id`=`foto`.`user_id`
ORDER BY `foto_id` ASC
---
    public function data_foto(){
        $rows = $this->fotoModel
                ->join("album","album.album_id=foto.album_id","left")
                ->join("user","user.user_id=foto.user_id","left")
                ->orderBy("foto_id","asc")
                ->FindAll();

SELECT *
FROM `foto`
LEFT JOIN `user` ON `user`.`user_id`=`foto`.`user_id`
WHERE `foto_id` = '34'
 LIMIT 1
---
    public function preview_foto($foto_id){
        $userId = session()->user_id;

        $foto = $this->fotoModel
                ->join("user","user.user_id=foto.user_id","left")
                ->where("foto_id",$foto_id)
                ->first();